In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import LabelEncoder

/Users/apple/opt/anaconda3/lib/python3.9/site-packages/scipy/__init__.py:146: UserWarning: A NumPy version >=1.16.5 and <1.23.0 is required for this version of SciPy (detected version 1.26.2
  warnings.warn(f"A NumPy version >={np_minversion} and <{np_maxversion}"

In [2]:
df = pd.read_csv('Opportunity Wise Data.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20322 entries, 0 to 20321
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Profile Id                20322 non-null  object
 1   Opportunity Id            20322 non-null  object
 2   Opportunity Name          20322 non-null  object
 3   Opportunity Category      20322 non-null  object
 4   Opportunity End Date      20322 non-null  object
 5   Gender                    20321 non-null  object
 6   City                      20321 non-null  object
 7   State                     20316 non-null  object
 8   Country                   20322 non-null  object
 9   Zip Code                  20320 non-null  object
 10  Graduation Date(YYYY MM)  20321 non-null  object
 11  Current Student Status    20321 non-null  object
 12  Current/Intended Major    20318 non-null  object
 13  Status Description        20322 non-null  object
 14  Apply Date                20322 non-null  object
 15  Opportunity Start Date    19518 non-null  object
 16  Reward Amount             2521 non-null   float64
 17  Badge Id                  2521 non-null   object
 18  Badge Name                2521 non-null   object
 19  Skill Points Earned       2521 non-null   float64
 20  Skills Earned             2521 non-null   object
dtypes: float64(2), object(19)
memory usage: 3.3+ MB

In [4]:
df.head()

,Profile Id,Opportunity Id,Opportunity Name,Opportunity Category,Opportunity End Date,Gender,City,State,Country,Zip Code,...,Current Student Status,Current/Intended Major,Status Description,Apply Date,Opportunity Start Date,Reward Amount,Badge Id,Badge Name,Skill Points Earned,Skills Earned
0,31ce84c2-2bd1-40ba-b2d8-f164fe125306,00000000-0G4F-19XB-EXPW-KS8F3N,Statement of Purpose (SOP) Writing Workshop,Event,"Jan 05, 2023, 18:58:39",Male,Dhaka,Savar,Bangladesh,1342,...,High School Student,Data Science,Not Started,"Oct 03, 2022, 17:29:17","Jan 05, 2023, 18:52:39",NaN,NaN,NaN,NaN,NaN
1,36814990-f854-4f76-8c63-91f27567d080,00000000-0G4F-19XB-EXPW-KS8F3N,Statement of Purpose (SOP) Writing Workshop,Event,"Jan 05, 2023, 18:58:39",Female,Amritsar,Punjab,Afghanistan,123242,...,Undergraduate Student,Otheraassss,Rewards Award,"Jan 05, 2023, 18:58:37","Jan 05, 2023, 18:52:39",200.0,00000000-0GSP-A3RB-BT5G-1ECTG9,Statement of Purpose (SOP) Writing Workshop,10.0,"[""Critical Thinking"",""Creative Thinking"",""Comm..."
2,8154328c-f8fe-4bd1-af05-783e140f68b5,00000000-0G4F-19XB-EXPW-KS8F3N,Statement of Purpose (SOP) Writing Workshop,Event,"Jan 05, 2023, 18:58:39",Female,Satna,Madhya pradesh,India,485001,...,High School Student,Computer Science and Engineering,Not Started,"Oct 04, 2022, 08:10:07","Jan 05, 2023, 18:52:39",NaN,NaN,NaN,NaN,NaN
3,a83abad6-db1e-44c4-a8f4-9e397e282d73,00000000-0G4F-19XB-EXPW-KS8F3N,Statement of Purpose (SOP) Writing Workshop,Event,"Jan 05, 2023, 18:58:39",Male,Hyderabad,Telangana,India,500039,...,Graduate Program Student,Computer Science,Not Started,"Oct 05, 2022, 13:41:47","Jan 05, 2023, 18:52:39",NaN,NaN,NaN,NaN,NaN
4,c2b8a15f-2ba3-41e4-a553-7ca68b0d4a54,00000000-0G4F-19XB-EXPW-KS8F3N,Statement of Purpose (SOP) Writing Workshop,Event,"Jan 05, 2023, 18:58:39",Male,Bangalore,Karnataka,India,560105,...,Undergraduate Student,jknhk,Not Started,"Oct 05, 2022, 11:07:17","Jan 05, 2023, 18:52:39",NaN,NaN,NaN,NaN,NaN

In [5]:
df.nunique()

Profile Id                  11481
Opportunity Id                 33
Opportunity Name               33
Opportunity Category            5
Opportunity End Date           29
Gender                          4
City                         3141
State                        1371
Country                       108
Zip Code                     5190
Graduation Date(YYYY MM)      321
Current Student Status          4
Current/Intended Major        969
Status Description              8
Apply Date                  20277
Opportunity Start Date         51
Reward Amount                  10
Badge Id                       56
Badge Name                     56
Skill Points Earned            31
Skills Earned                  24
dtype: int64

In [6]:
df['Status Description'].unique()

array(['Not Started', 'Rewards Award', 'Team Allocated', 'Started',
       'Withdraw', 'Dropped Out', 'Rejected', 'Applied'], dtype=object)

In [8]:
df.describe()

       Reward Amount  Skill Points Earned
count    2521.000000          2521.000000
mean     1081.261404          1186.964697
std       927.251398           399.172150
min        50.000000            10.000000
25%       500.000000          1182.000000
50%       500.000000          1182.000000
75%      2500.000000          1182.000000
max      2500.000000          1776.000000

In [9]:
# Determine missing values
missing_values = df.isnull().sum()

# Calculate the percentage of missing values
total_values = df.shape[0]
percentage_missing = (missing_values / total_values) * 100

# Create a summary table
df_summary_table = pd.DataFrame({'Missing Values': missing_values, 'Percentage Missing': percentage_missing})

print(df_summary_table)

                          Missing Values  Percentage Missing
Profile Id                             0            0.000000
Opportunity Id                         0            0.000000
Opportunity Name                       0            0.000000
Opportunity Category                   0            0.000000
Opportunity End Date                   0            0.000000
Gender                                 1            0.004921
City                                   1            0.004921
State                                  6            0.029525
Country                                0            0.000000
Zip Code                               2            0.009842
Graduation Date(YYYY MM)               1            0.004921
Current Student Status                 1            0.004921
Current/Intended Major                 4            0.019683
Status Description                     0            0.000000
Apply Date                             0            0.000000
Opportunity Start Date               804            3.956304
Reward Amount                      17801           87.594725
Badge Id                           17801           87.594725
Badge Name                         17801           87.594725
Skill Points Earned                17801           87.594725
Skills Earned                      17801           87.594725

In [10]:
#Since missing values is more that 50% we will drop those columns
df = df.drop(columns=['Reward Amount', 'Badge Id', 'Badge Name', 'Skill Points Earned', 'Skills Earned'])

In [ ]:
df = df.dropna()

In [11]:
# Determine missing values
missing_values = df.isnull().sum()

# Calculate the percentage of missing values
total_values = df.shape[0]
percentage_missing = (missing_values / total_values) * 100

# Create a summary table
df_summary_table = pd.DataFrame({'Missing Values': missing_values, 'Percentage Missing': percentage_missing})

print(df_summary_table)

                          Missing Values  Percentage Missing
Profile Id                             0            0.000000
Opportunity Id                         0            0.000000
Opportunity Name                       0            0.000000
Opportunity Category                   0            0.000000
Opportunity End Date                   0            0.000000
Gender                                 1            0.004921
City                                   1            0.004921
State                                  6            0.029525
Country                                0            0.000000
Zip Code                               2            0.009842
Graduation Date(YYYY MM)               1            0.004921
Current Student Status                 1            0.004921
Current/Intended Major                 4            0.019683
Status Description                     0            0.000000
Apply Date                             0            0.000000
Opportunity Start Date               804            3.956304

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20322 entries, 0 to 20321
Data columns (total 16 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Profile Id                20322 non-null  object
 1   Opportunity Id            20322 non-null  object
 2   Opportunity Name          20322 non-null  object
 3   Opportunity Category      20322 non-null  object
 4   Opportunity End Date      20322 non-null  object
 5   Gender                    20321 non-null  object
 6   City                      20321 non-null  object
 7   State                     20316 non-null  object
 8   Country                   20322 non-null  object
 9   Zip Code                  20320 non-null  object
 10  Graduation Date(YYYY MM)  20321 non-null  object
 11  Current Student Status    20321 non-null  object
 12  Current/Intended Major    20318 non-null  object
 13  Status Description        20322 non-null  object
 14  Apply Date                20322 non-null  object
 15  Opportunity Start Date    19518 non-null  object
dtypes: object(16)
memory usage: 2.5+ MB

#Handling Outliers and Anomalies
Since the data is all categorical not numerical. Therefore, the concept of outliers doesnâ€™t directly apply here as it does for numerical data.


#Normalize or Scale Relevant Features
Similarly,the concept of normalization doesnâ€™t apply here as it does for numerical data.

#Addressing Data Quality Issues

In [13]:
df.describe()

,Profile Id,Opportunity Id,Opportunity Name,Opportunity Category,Opportunity End Date,Gender,City,State,Country,Zip Code,Graduation Date(YYYY MM),Current Student Status,Current/Intended Major,Status Description,Apply Date,Opportunity Start Date
count,20322,20322,20322,20322,20322,20321,20321,20316,20322,20320,20321,20321,20318,20322,20322,19518
unique,11481,33,33,5,29,4,3141,1371,108,5190,321,4,969,8,20277,51
top,18e1e6bc-fada-4b09-bf52-ab45daf318f4,00000000-0GWQ-AXC5-X45C-2MHJ28,Data Visualization,Internship,"Jan 01, 2024, 03:30:46",Male,Saint Louis,Missouri,India,63108,2025-05,Graduate Program Student,Computer Science,Team Allocated,"Aug 29, 2023, 05:30:24","Aug 07, 2023, 04:30:00"
freq,22,5687,5687,15360,14938,12240,1326,2115,9132,1831,2195,9297,2654,14206,3,2323

In [14]:
df.duplicated().sum()

0

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20322 entries, 0 to 20321
Data columns (total 16 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Profile Id                20322 non-null  object
 1   Opportunity Id            20322 non-null  object
 2   Opportunity Name          20322 non-null  object
 3   Opportunity Category      20322 non-null  object
 4   Opportunity End Date      20322 non-null  object
 5   Gender                    20321 non-null  object
 6   City                      20321 non-null  object
 7   State                     20316 non-null  object
 8   Country                   20322 non-null  object
 9   Zip Code                  20320 non-null  object
 10  Graduation Date(YYYY MM)  20321 non-null  object
 11  Current Student Status    20321 non-null  object
 12  Current/Intended Major    20318 non-null  object
 13  Status Description        20322 non-null  object
 14  Apply Date                20322 non-null  object
 15  Opportunity Start Date    19518 non-null  object
dtypes: object(16)
memory usage: 2.5+ MB

In [16]:
df['Opportunity End Date'] = pd.to_datetime(df['Opportunity End Date'])
df['Opportunity Start Date'] = pd.to_datetime(df['Opportunity Start Date'])

In [17]:
df['Apply Date'] = pd.to_datetime(df['Apply Date'], errors='coerce')
df['Graduation Date(YYYY MM)'] = pd.to_datetime(df['Graduation Date(YYYY MM)'], errors='coerce')

#Feature Engineering

In [18]:
df['Opportunity Duration'] = (df['Opportunity End Date'] - df['Opportunity Start Date']).dt.days

In [19]:
df['Application Lead Time'] = (df['Opportunity Start Date'] - df['Apply Date']).dt.days

#Data Transformation

In [20]:
le = LabelEncoder()
df['Opportunity Category'] = le.fit_transform(df['Opportunity Category'])
df['Gender'] = le.fit_transform(df['Gender'])
df['Current Student Status'] = le.fit_transform(df['Current Student Status'])
df['Status Description'] = le.fit_transform(df['Status Description'])

In [22]:
df.to_csv('clean_preprocess_opportunity_wise_data.csv', index=False)